src/Documents/Вложение/Вложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вложение</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВложения</name>
    <type>
      <types>EnumRef.ВидВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидВложения/ВидВложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидВложения</name>
  <enumValues>
    <name>НакладнаяСчет</name>
  </enumValues>
  <enumValues>
    <name>СертификатПротокол</name>
  </enumValues>
  <enumValues>
    <name>Прайс</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Вложение/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления ( Поля, СтандартнаяОбработка )
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить ( "ВидВложения" );
	Поля.Добавить ( "Номер" );
	Поля.Добавить ( "Дата" );
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления ( Данные, Представление, СтандартнаяОбработка )
	
	СтандартнаяОбработка = Ложь;
	с = ПолучитьПредставлениеПоВиду ( Данные.ВидВложения );
	Представление = с + " от " + Формат ( Данные.Дата, "ДФ=dd.MM.yyyy" ) + " номер " + Данные.Номер;
	
КонецПроцедуры

Функция ПолучитьПредставлениеПоВиду ( ВидВложения ) Экспорт
	
	с = "";
	Если ( ВидВложения = Перечисления.ВидВложения.НакладнаяСчет ) Тогда
		с = "Накладная (счет)";
	ИначеЕсли ( ВидВложения = Перечисления.ВидВложения.СертификатПротокол ) Тогда
		с = "Сертификат (протокол)";
	ИначеЕсли ( ВидВложения = Перечисления.ВидВложения.Прайс ) Тогда
		с = "Прайс";		
	КонецЕсли;
	Возврат с;

КонецФункции
